<?php defined('SYSPATH') OR die('No direct access allowed.');

$lang = array
(
	'undefined_group'       => 'Группа %s не определена Вашей конфигурацией.',
	'error'                 => 'Ошибка SQL: %s',
	'connection'            => 'Не удалось подключиться к базе данных: %s',
	'invalid_dsn'           => 'Переданный DSN некорректен: %s',
	'must_use_set'          => 'Необходимо использовать оператор SET в этом запросе.',
	'must_use_where'        => 'Необходимо использовать оператор WHERE в этом запросе.',
	'must_use_table'        => 'Необходимо указать таблицу базы данных в этом запросе.',
	'table_not_found'       => 'Таблица %s не существует в Вашей базе данных.',
	'not_implemented'       => 'Запрошенный метод, %s, не поддерживается этим драйвером.',
	'result_read_only'      => 'Результат запроса доступен только для чтения.'
);
