<?php defined('SYSPATH') OR die('No direct access allowed.');

$lang = array
(
	'userfile_not_set'   => 'POST-переменная %s не найдена.',
	'file_exceeds_limit' => 'Размер закачанного файла превышает максимальный разрешённый конфигурацией PHP',
	'file_partial'       => 'Файл закачан не полностью',
	'no_file_selected'   => 'Вы не выбрали файл для закачивания',
	'invalid_filetype'   => 'Тип файла, который вы пытаетесь закачать, не разрешён.',
	'invalid_filesize'   => 'Размер файла, который вы пытаетесь закачать, превышает максимальный разрешённый (%s)',
	'invalid_dimensions' => 'Разрешение картинки, которую вы пытаетесь закачать, превышает максимальное разрешённое (%s)',
	'destination_error'  => 'Не удалось переместить закачанный файл в пункт назначения.',
	'no_filepath'        => 'Путь для закачивания некорректен.',
	'no_file_types'      => 'Вы не разрешили ни один тип файлов.',
	'bad_filename'       => 'Файл с таким именем уже существует на сервере.',
	'not_writable'       => 'Запись в целевой каталог, %s, не возможна.',
	'error_on_file'      => 'Ошибка при закачивании %s:',
	// Error code responses
	'set_allowed'        => 'В целях безопасности, установите разрешённые для закачивания типы файлов.',
	'max_file_size'      => 'В целях безопасности, не используйте MAX_FILE_SIZE для ограничения размера закачиваемых файлов.',
	'no_tmp_dir'         => 'Временная директория для закачивания файлов не найдена.',
	'tmp_unwritable'     => 'Нет прав записи во временную директорию для закачивания файлов, %s.'
);
